<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xml:lang="en" xmlns="http://www.w3.org/1999/xhtml" lang="en">
<head>
  <title>Level 1 NPCs</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
  <link rel="stylesheet" href="style/g3readme.css" type="text/css" />
  <link href="style/g3web.ico" rel="icon" type="image/bmp" />
</head>
<body>
<h1>
    Level 1 NPCs
  </h1>
<div class="section">
      <strong><a href="http://www.gibberlings3.net/">Un Mod de Gibberlings Three</a><br />
      Auteur : <a href="http://gibberlings3.net/forums/?showuser=1119">Nythrun</a><br />
      Contribution : <a href="http://gibberlings3.net/forums/index.php?showuser=844">cmorgan</a>,
      <a href="http://gibberlings3.net/forums/index.php?showuser=795">Azazello</a>,
      <a href="http://gibberlings3.net/forums/index.php?showuser=1216">Miloch</a></strong><strong>,
      <a href="http://gibberlings3.net/forums/index.php?showuser=2506">erik</a></strong><br />
<strong>Sur le web : <a href="http://www.gibberlings3.net/lev1npcs/">Page d'accueil</a></strong>
et <strong><a href="http://gibberlings3.net/forums/index.php?showforum=140">forum de discussion</a></strong><br />
      <br />
      <strong>Version 1.7 - <a href="http://gibberlings3.net/forums/index.php?app=downloads&amp;showcat=42">V&eacute;rifiez
  quelle est la version la plus r&eacute;cente</a></strong><br />
      <strong>Langues :</strong> Anglais, Polonais, Fran&ccedil;ais, Espagnol<br />
      <strong>Plateformes :</strong> Windows, Mac OS X, et Linux
    </div>
<h2>
      Contenu
    </h2>
<div class="section">
      <strong><a href="#notes">Remarques</a><br />
      <a href="#overview">Introduction</a><br />
      <a href="#compat">Compatibilit&eacute;</a><br />
      <a href="#install">Installation</a><br />
      <a href="#compon">Composants</a><br />
      <a href="#thanks">Remerciements</a><br />
      <a href="#contact">G&eacute;n&eacute;rique et Informations de droits d'auteur</a><br />
      <a href="#history">Historique des versions</a></strong>
    </div>
<h2>
      <a name="notes" id="notes">Remarques</a>
    </h2>
<div class="section">
      <em>D&eacute;sinstaller toutes les versions pr&eacute;c&eacute;dentes avant
      d'installer cette version, s'il vous pla&icirc;t.</em><br />
      <br />
      <strong>Remarque :</strong> lorsque vous rencontrez pour la premi&egrave;re
      fois un PNJ enr&ocirc;lable lors d'une nouvelle partie,<acronym title="Non-Player Character"></acronym>
      ce PNJ est ajout&eacute; &agrave; votre sauvegarde<acronym title="Non-Player Character"></acronym>.
En cons&eacute;quence, utiliser ce mod pour modifier des PNJs
apr&egrave;s que vous ayez visit&eacute; la carte o&ugrave; il se
trouve ne modifiera pas cette sauvegarde, et de d&eacute;sinstaller les
modifications d'un composant apr&egrave;s le recrutement d'un membre du
groupe n'aura aucun effet sur cette sauvegarde.
    </div>
<h2>
      <a id="overview" name="overview">Introduction</a>
    </h2>
<div class="section">
      Le mod <strong>Level 1 <acronym title="Non-Player Characters">NPCs</acronym></strong>
      est un d&eacute;riv&eacute; du mod
      <a href="http://www.fortunecity.com/boozers/winelodge/79/bgstuff/bgstuff.html">Alternate
      <acronym title="Baldur's Gate II">BG2</acronym> <acronym title="Non-Player Characters">NPCs</acronym></a>
      de Gebhart Blucher (lvl1npcs.zip).
      <strong>Azazello</strong> recommanda de le remixer en <acronym title="Weimer Dialogue Utility">WeiDU</acronym>,
      <strong>cmorgan</strong> poussa pour son d&eacute;veloppement et <strong>Nythrun</strong>
      coda religieusement le mod et le rendit monstrueux (dans le bon sens, bien entendu).<br />
      <br />
Ce mod est d&eacute;nomm&eacute; "Level 1" car les PNJs ainsi
modd&eacute;s d&eacute;marrent comme des personnages de niveau 1 avec
un exc&eacute;dent de points d'exp&eacute;rience. Lorsqu'ils rejoignent
votre groupe, vous pouvez les monter de niveaux et choisir leurs
comp&eacute;tences. Leurs points d'exp&eacute;rience finissent par
&ecirc;tre identiques &agrave; ceux qu'ils auraient eu si le mod
n'avait pas &eacute;t&eacute; install&eacute;.<br />
<br />
Le mod de Blucher autorisait les joueurs &agrave; utiliser des kits et des
classes diff&eacute;rents de ceux assign&eacute;s par d&eacute;faut
&agrave; plusieurs PNJs de BG2. Ce mod autorisait un nombre
limit&eacute; de choix de kits et de classes, pour un nombre restreint
de PNJs.<br />
<br />
<strong>Level 1 <acronym title="Non-Player Characters">NPCs</acronym></strong> &eacute;tend
le concept original en autorisant les joueurs &agrave; assigner <strong><em>n'importe quel</em></strong>
kit/classe - y compris les personnalis&eacute;s - &agrave; <strong><em>n'importe quel</em></strong>
PNJs et ce, dans BG1 <strong><em>comme</em></strong> BG2. Ce mod permet &eacute;galement
aux joueurs de modifier les talents et comp&eacute;tences martiales des PNJs.<br />
<br />
Cernd en Moine, Mazzy en Paladin, Jaheira en Kensai et Valygar en Tueur
de Magiciens n'en sont que quelques exemples. Les combinaisons sont
infinies et les choix ne sont faits qu'en fonction des
int&eacute;r&ecirc;ts des joueurs.<br />
<br />
L'avantage suppl&eacute;mentaire du mod r&eacute;side dans le fait
qu'il autorise le joueur &agrave; essayer des kits personnalis&eacute;s
provenant d'autres mods, et &agrave; les appliquer &agrave; autant de PNJs du
jeu original qu'il le d&eacute;sire.<br />
<br />
Vous pouvez lire davantage de d&eacute;tails sur le
<strong><a href="http://gibberlings3.net/forums/index.php?showforum=140">forum</a></strong>
du mod et dans son fil de <strong><a href="http://gibberlings3.net/forums/index.php?showtopic=12239"><acronym title="Frequently Asked Questions">FAQ</acronym></a></strong>
(en anglais). N'h&eacute;sitez pas &agrave; nous communiquer tous les
bugs et vos suggestions d'am&eacute;liorations dans le forum du mod. </div>
<h2>
  <a name="compat" id="compat">Compatibilit&eacute;</a>
</h2>
<div class="section">Ce mod est con&ccedil;u pour
fonctionner avec <acronym title="Baldur's Gate II">BG2</acronym>:
Shadows of Amn, avec ou sans l'extension Throne of Bhaal.
Si Throne of Bhaal n'est pas install&eacute;, vous ne pourrez pas
assigner de kit bas&eacute; sur l'entropiste. Faites attention d'avoir
install&eacute; le dernier patch du jeu avant d'installer des mods : c'est
&agrave; dire le patch <a href="http://www.bioware.com/games/shadows_amn/support/patches">23037</a>
pour <acronym title="Shadows of Amn">SoA</acronym> et le patch
<a href="http://www.bioware.com/games/throne_bhaal/support/patches">26498</a>
pour les jeux incluant <acronym title="Throne of Bhaal">ToB</acronym>. N'installez
sous aucun pr&eacute;texte la version beta du patch 26499, qui ne ferait que
rendre incompatible votre jeu. Consultez les fichiers ReadMe relatifs &agrave;
votre patch dans le r&eacute;pertoire d'installation du jeu et le site de
<a href="http://www.bioware.com/support/games/">BioWare</a> si n&eacute;cessaire.<br />
<br />
Ce mod est pr&eacute;vu pour fonctionner avec tous les autres mods, y compris
<a href="http://www.pocketplane.net/tutu/">Baldur's Gate Tutu</a> (et EasyTutu)
et <a href="http://www.shsforums.net/index.php?showforum=261">Baldur's
Gate Trilogy</a>. Nous vous recommandons d'installer le
<a href="http://www.gibberlings3.net/bg2fixpack/"><acronym title="Baldur's Gate II">BG2</acronym> Fixpack</a>
pour toutes vos installations, except&eacute; pour Tutu. Si vous
d&eacute;cidez de ne pas l'installer, il se pourrait que nous ne
puissions pas vous aider dans les bugs que vous rencontrerez en jeu, ou
ajout&eacute;s par Baldurdash.<br />
<br />
Vous pouvez installer ce mod en cours de partie, mais les modifications
ne prendront effet que pour les PNJs n'ayant pas encore rejoint votre
groupe.<acronym title="Non-Player Character"></acronym><br />
<br />
M&ecirc;me si vous pouvez installer ce mod &agrave; n'importe quel
moment, nous vous recommandons de le placer proche de la fin de votre
liste d'installation. Si vous d&eacute;sirez assigner un kit
personnalis&eacute; &agrave; un <acronym title="Non-Player Character">PNJ</acronym>,
prenez garde d'installer <em></em><strong>Level 1 <acronym title="Non-Player Characters">NPCs</acronym></strong>
<em>apr&egrave;s</em> le mod ajoutant le kit personnalis&eacute;. Si vous
d&eacute;sirez utiliser <a href="http://www.pocketplane.net">Ashes of Embers</a>
ou tout autre mod modifiant les r&egrave;gles de comp&eacute;tences
martiales, vous devrez &eacute;galement installer le mod apr&egrave;s
celui modifiant les r&egrave;gles.<br />
<br />
Si vous d&eacute;sirez  installer le composant <strong>Modifier le syst&egrave;me
des comp&eacute;tences martiales Style BG1</strong><strong><acronym title="Baldur's Gate"></acronym></strong> du
<a href="http://www.gibberlings3.net/bg2tweaks/index.php"><acronym title="Baldur's Gate II">BG2</acronym> Tweaks</a>,
vous pouvez &agrave; pr&eacute;sent l'installer avant <strong>Level 1 <acronym title="Non-Player Characters">NPCs</acronym></strong>,
les comp&eacute;tences martiales seront alors distribu&eacute;es correctement.
Vous pouvez &eacute;galement choisir de l'installer apr&egrave;s Level 1 <acronym title="Non-Player Characters">NPCs</acronym>.<br />
<br />
Si vous avez install&eacute; le composant <strong>Capacit&eacute;s sp&eacute;ciales
de haut niveau modifi&eacute;es</strong> de <a href="http://www.shsforums.net/index.php?showforum=116">Refinements</a>,
un multiclassage de kits causera un crash du jeu &agrave; chaque mont&eacute;e
de niveau engendrant la s&eacute;lection d'une capacit&eacute; de haut niveau.
Ce n'est pas un bug de <strong>Level 1 <acronym title="Non-Player Characters">NPCs</acronym></strong> -
ne tentez pas de conjurer  le sort en testant toutes sorts de kits multiclass&eacute;s avec
<a href="http://www.shsforums.net/index.php?showforum=116">Refinements</a>
d'install&eacute;, et diff&eacute;rez plut&ocirc;t votre gnome Clerc/(trivialement)Illusioniste &agrave;
une prochaine partie.<br />
<br />
</div>
<h2>
    <a name="install" id="install">Installation</a>
  </h2>
<div class="section">
      <em><strong>Remarque :</strong> Si vous avez d&eacute;j&agrave;
      install&eacute; une version du mod, supprimez-la avant d'extraire la
      nouvelle version. Pour cela, lancez <strong>setup-level1npcs.exe</strong>
      (ou .command si vous  &ecirc;tes sous OS X), d&eacute;sinstallez
      tous les composants pr&eacute;c&eacute;demment install&eacute;s et supprimez
      le r&eacute;pertoire level1npcs.</em><br />
      <br />
      <em>Lorsque vous installez ou
d&eacute;sinstallez, ne fermez pas la fen&ecirc;tre <acronym title="Disk Operating System">DOS</acronym> en
cliquant sur le bouton <strong>X</strong> ! A la place, pressez le bouton <strong>Entr&eacute;e</strong>
lorsque l'invite de commande vous le demande.</em><br />
      <br />
      <strong>Windows</strong><br />
Extrayez le contenu du mod vers le r&eacute;pertoire du jeu que
vous voulez modifier (<acronym title="Baldur's Gate II">BG2</acronym>, Tutu ou
<acronym title="Baldur's Gate Trilogy">BGT</acronym>), selon quel jeu vous
d&eacute;sirez modifier. Pour installer le mod, double-cliquez
simplement sur <strong>Level_1_NPCs[-version#].exe</strong> et suivez
les instructions qui apparaissent &agrave; l'&eacute;cran.<br />
      <br />
L'installation devrait faire appara&icirc;tre automatiquement une fen&ecirc;tre
<acronym title="Disk Operating System">DOS</acronym>
qui vous posera des questions au sujet de l'installation du mod. Si
cela n'arrivait pas, rendez-vous dans le r&eacute;pertoire de votre jeu
et double-cliquez sur <strong>setup-level1npcs.exe</strong> pour le lancer
manuellement.<br />
      <br />
      Lancez <strong>setup-level1npcs.exe</strong> dans
le r&eacute;pertoire principal du jeu afin de r&eacute;installer, de
d&eacute;sinstaller ou d'effectuer des changements dans le choix des
composants.<br />
      <br />
      <strong>Mac OS X</strong><br />
Extrayez le contenu du mod dans le r&eacute;pertoire du jeu que vous
voulez modifier (<acronym title="Baldur's Gate II">BG2</acronym>, Tutu ou
<acronym title="Baldur's Gate Trilogy">BGT</acronym>). Vous pouvez extraire
les fichiers de l'archive en utilisant <a href=
"http://www.macupdate.com/app/mac/17741/rar-expander">RAR Expander</a> ou
tout autre utilitaire de d&eacute;compression de fichiers qui
sache g&eacute;rer des fichiers .rar. Si l'extraction s'est bien
pass&eacute;e, vous devriez avoir un
r&eacute;pertoire level1npcs dans le r&eacute;pertoire de votre
jeu. T&eacute;l&eacute;chargez  la
version OS X de WeiDU (ou copiez l'ex&eacute;cutable d'un autre mod) et
renommez-le setup-level1npcs. Placez-le, ainsi que le fichier
setup-level1npcs.command, dans le sous-r&eacute;pertoire level1npcs du
r&eacute;pertoire du jeu. Pour installer le
mod,
double-cliquez sur <strong>setup-level1npcs.command</strong> et suivez
les instructions qui apparaissent &agrave; l'&eacute;cran.<br />
      <br />
      <strong>Linux</strong><br />
Extrayez le contenu du mod dans le r&eacute;pertoire du jeu que
vous voulez modifier. Si le mod n'a pas &eacute;t&eacute; compil&eacute; avec, t&eacute;l&eacute;chargez la
derni&egrave;re version de Linux de <a href="http://www.weidu.org/users/thebigg/"><acronym title="Weimer Dialogue Utility">WeiDU</acronym></a>
et copiez WeiDU et WeInstall dans /usr/bin. Lancez <strong>WeInstall
setup-level1npcs</strong> depuis le r&eacute;pertoire de votre jeu pour
installer le mod. Lancez ensuite <strong>wine BGMain.exe</strong> et commencez
&agrave; jouer.<br />
<br />
<strong>Installation automatis&eacute;e (batch)</strong><br />
Vous pourriez pr&eacute;f&eacute;rer installer le mod par
l'interm&eacute;diaire d'un fichier batch contenant les choix
pr&eacute;s&eacute;lectionn&eacute;s. Un exemple pour BGT sans mod
ajoutant des PNJs se trouve dans le r&eacute;pertoire "batchlog",
et peut &ecirc;tre modifi&eacute; pour correspondre &agrave; votre jeu. Pour
ce faire, vous devrez copier les fichiers levelonenpc.cmd et
levelonenpc.txt dans le r&eacute;pertoire de votre jeu, modifier le
fichier levelonenpc.txt pour refl&eacute;ter vos
pr&eacute;f&eacute;rences, puis ex&eacute;cuter le fichier
levelonenpc.cmd pour installer le mod. Des moyens alternatifs existent
certainement, et seront probablement document&eacute;s dans un avenir
proche. :)<br />
    </div>
<h2>
      <a name="compon" id="compon">Composants</a>
    </h2>
<div class="section">
      <strong>Liste des PNJs recrutables</strong> - <em>Requis pour tous
      les autres composants</em><br />
      <br />
Ce composant passe en revue et indexe tous les <acronym title="Non-Player Characters">PNJs</acronym>
standards dans votre jeu. Il corrige &eacute;galement les cr&eacute;atures utilisant la mauvaise
version des effets. Vous pouvez &eacute;galement d&eacute;sinstaller
r&eacute;cusirvement tous les autres composants que vous aviez
pr&eacute;c&eacute;demment install&eacute;s en ne d&eacute;sinstallant
que celui-ci.<br />
      <br />
      <strong>Modification des comp&eacute;tences martiales pour certaines
      classes</strong> - <em>Facultatif</em><br />
      <br />
Ce composant alt&egrave;re les r&egrave;gles des comp&eacute;tences martiales
comme d'autres mods comme <a href="http://www.pocketplane.net/aoe/">Ashes of Embers</a>
ou <a href="http://www.shsforums.net/index.php?showforum=79">Rogue Rebalancing</a>,
avec des sp&eacute;cificit&eacute;s d&eacute;crites ci-dessous.<br />
      <br />
Lorsque vous modifier les PNJs recrutables<acronym title="Non-Player Characters"></acronym>,
ce mod se plie &agrave; toute r&egrave;gle d&eacute;j&agrave;
&eacute;tablie. Ainsi, si vous d&eacute;sirez que les mages puissent
utiliser des arbal&egrave;tes, et qu'Edwin puisse utiliser une
arbal&egrave;te, vous devrez changer les r&egrave;gles afin que ce mod
sache quelle r&egrave;gle suivre. La majeure partie du pr&eacute;sent
contenu refl&egrave;te d'autres mods et est &eacute;nonc&eacute; par
commodit&eacute;, ou comme une alternative aux nombreux mods devant
&ecirc;tre install&eacute;s en dernier.<br />
      <br />
Vous pouvez :
<ul>
    <li>Autoriser aux clercs une &eacute;toile dans
n'importe quel type d'arme permis &agrave; un guerrier ; si l'arme de
pr&eacute;dilection de votre divinit&eacute; est une
&eacute;p&eacute;e, vous devriez sacr&eacute;ment &ecirc;tre en mesure
d'utiliser une &eacute;p&eacute;e ! :) D&egrave;s lors, vous aurez la
possibilit&eacute; de choisir d'autoriser aux clercs une
&eacute;toile (ce qui induira par d&eacute;faut les 3 changement
qui suivent), de choisir parmi les options de fa&ccedil;on
s&eacute;par&eacute;e, ou d'&eacute;viter toutes les modifications
concernant les clercs. </li>
    <li>Si vous avez refus&eacute; "une &eacute;toile dans tout pour les clercs",
    autoriser aux clercs/mages une &eacute;toile dans n'importe quel type d'arme
permis &agrave; un mage (choix 1 pour les dagues et les fl&eacute;chettes, ou
choix 2 pour les dagues uniquement).</li>
    <li>Si vous avez refus&eacute;
"une &eacute;toile dans tout pour les clercs", autoriser aux
clercs/voleurs une &eacute;toile dans n'importe quel type d'arme
permis &agrave; un voleur (choix 1 pour toutes les armes de
voleurs, choix 2 pour les &eacute;p&eacute;es courtes et les
dagues, ou choix 3 pour pour les
dagues uniquement).</li>
    <li>Si vous avez refus&eacute; "une &eacute;toile dans tout pour les clercs",
autoriser aux clercs/r&ocirc;deurs une &eacute;toile dans n'importe quel type
d'arme de r&ocirc;deur (choix 1 pour toutes les armes, choix 2 pour les
&eacute;p&eacute;es longues et les arcs longs, choix 3 pour les
&eacute;p&eacute;es longues uniquement, ou choix 4 pour les arcs longs
uniquement).</li>
    <li>Si vous avez refus&eacute; "une &eacute;toile dans tout pour les clercs",
autoriser aux guerriers/clercs deux &eacute;toiles dans n'importe quel type
d'arme - vous utilisez les rectrictions du guerrieur plut&ocirc;t que celles du
clerc, comme le font d&eacute;j&agrave; les guerriers/mages et les guerriers/voleurs.
Choisir "2" n'autorise que les haches en sus des armes standards du
clerc. </li>
    <li>Si vous avez refus&eacute; "une &eacute;toile dans tout pour les clercs",
autoriser aux guerriers/mages/clercs deux &eacute;toiles dans n'importe quel
type d'arme. Choisir "2" n'autorise que les dagues en sus des armes
standards du clerc. Je suis certain que vous parviendrez &agrave; vous
d&eacute;cider. :)</li>
    <li>Autoriser aux druides une &eacute;toile dans
n'importe quel type d'arme permis a un guerrier. Cela permettra aux
guerriers/druides multiclass&eacute;s la panoplie compl&egrave;te
d'armes disponibles pour les guerriers (conform&eacute;ment aux
r&egrave;gles de la Seconde Edition d'AD&amp;D). </li>
    <li>Interdire aux guerriers/druides les armures
que les druides monoclass&eacute;s ne peuvent pas porter - sur
demande ; cela semble plus proche des r&egrave;gles arbitraires de
la 2nd &eacute;dition dans tous les cas. Ce composant sera
automatiquement pass&eacute; si vous avez install&eacute;
"Restrict Fighter/Druids to Armor that Druids Can Wear" de <a href="http://www.gibberlings3.net/Cleric">Divine Remix</a>
ou d'<a href="http://www.gibberlings3.net/item_rev/">Item Revisions</a>, puisqu'ils
incluent d&eacute;j&agrave; ce changement.</li>
    <li>Autoriser la grande ma&icirc;trise aux
guerriers multiclass&eacute;s - ccertains vont trouver que c'est
la triche, mais si vous envisagiez de l'installer par le biais d'un
autre mod (e.g.BG2 Tweaks), alors autant l'appliquer de fa&ccedil;on
&agrave; ce que les personnages recrutables en
b&eacute;n&eacute;ficient aussi. Vous
pourrez le limiter &agrave; la ma&icirc;trise (3 &eacute;toiles),
&agrave; la haute ma&icirc;trise (4 &eacute;toiles), ou &agrave; la
grande ma&icirc;trise (5 &eacute;toiles). </li>
    <li>Autoriser la ma&icirc;trise des armes de m&eacute;l&eacute;e
aux barbares - comme ci-dessus, mais restreint &agrave; des armes de
corps &agrave; corps uniquement.
Vous pourrez le limiter &agrave; la ma&icirc;trise (3
&eacute;toiles), &agrave; la haute ma&icirc;trise (4 &eacute;toiles),
ou &agrave; la grande ma&icirc;trise (5 &eacute;toiles).</li>
    <li>Autoriser les voleurs, mages et bardes &agrave; affecter une &eacute;toile
dans n'importe quel type d'arme.
    </li>
    <li>Autoriser aux voleurs, multiclass&eacute;s ou
non, trois &eacute;toiles dans le combat &agrave; deux armes -
tout comme <a href="http://www.shsforums.net/index.php?showforum=79">Rogue
Rebalancing</a> d'aVENGER, <a href="http://www.gibberlings3.net/sns">Song and Silence</a>, et
probablement une douzaine d'autres mods. :)
    </li>
    <li>Autoriser l'attaque sournoise avec n'importe
quelle arme un mage/voleur, guerrier/voleur ou clerc/voleur pourrait
utiliser. Effectuer des attaques sournoises avec une &eacute;p&eacute;e
&agrave; deux mains ne devrait pas &ecirc;tre moins efficace que de le
faire avec un b&acirc;ton, n'est-ce pas ? </li>
    <li>Rendre l'attaque sournoise inutilisable avec les b&acirc;tons - sur demande.
    </li>
    <li>Rendre l'attaque sournoise inutilisable avec
les armes &agrave; 2 mains - remarquez que lors d'une partie sans
mod, la seule arme &agrave; deux mains avec laquelle il est possible de
r&eacute;aliser des attaques sournoises est le b&acirc;ton ; cela ne
devrait donc pas modifier grandement votre partie, &agrave; moins
d'avoir install&eacute; le composant "Autoriser l'attaque sournoise
avec des armes de voleurs multiclass&eacute;s.</li>
</ul>
<strong>Ajouter des kits aux PJs export&eacute;s</strong> - <em>Facultatif</em><br />
  <ol>
    <li>Uniquement lors du recrutement initial</li>
    <li>Lors du recrutement initial et au retour dans le groupe</li>
  </ol>
Ce composant autorise les courageux tricheurs,
euh, joueurs d'assigner un kit &agrave; un PJ export&eacute;. La plupart
des personnes int&eacute;ress&eacute;es utiliseront probablement un
&eacute;diteur comme DLTCEP ou NI &agrave; la place :). Vous ne
pouvez pas utiliser ce composant pour assigner un kit &agrave; un
personnage d&eacute;j&agrave; dot&eacute; d'un kit. Tout comme vous ne
pouvez pas d&eacute;sinstaller ce composant comme d'habitude, car
il n'effectue aucune modification dans votre partie proprement dite.
Vous pouvez, cependant, restaurer des personnages &agrave; partir du
r&eacute;pertoire level1npcs/backup/2
si vous n'&ecirc;tes pas satisfait de vos changements. Il est toujours
sage de garder une autre sauvegarde, au cas o&ugrave;.<br />
<br />
<strong>PNJs recrutables avec un experience plus proche de celle du personnage
principal</strong> - <em>Facultatif</em><br />
    <br />
    <acronym title="Non-Player Characters">Les PNJs</acronym>,
au moment de leur recrutement, auront la totalit&eacute; de leurs
points d'exp&eacute;rience ajust&eacute;e &agrave; une valeur plus
proche de celle du PJ. Des messages appara&icirc;tront dans la
fen&ecirc;tre du jeu pour vous renseigner sur ce qu'il advient et quand
cela finira et ce, afin de ne pas interrompre le fonctionnement de ce
composant. Apr&egrave;s que les points d'exp&eacute;rience aient
&eacute;t&eacute; ajust&eacute;s, le personnage n'aura plus qu'un seul
script de repos (ce qui vous permettra de remplir les cases
r&eacute;serv&eacute;es aux sorts &agrave; votre discr&eacute;tion).
Pour l'utiliser, soyez certain que l'IA de votre groupe, dans le coin
en bas &agrave; droite, est activ&eacute;e, s&eacute;lectionnez le
personnage, et pressez R. Retournez sur l'&eacute;cran principal et
vous observerez que votre personnage est &agrave; pr&eacute;sent au
repos (vous pouvez &agrave; pr&eacute;sent d&eacute;sactiver l'IA si
vous le d&eacute;sirez). Ce script dispara&icirc;tra automatiquement si
vous vous reposez, quittez la zone, sauvegardez la partie, modifiez la
composition de votre groupe, ou effectuez toute chose de cet ordre. Si
vous d&eacute;sirez l'utiliser, vous avez donc tout
int&eacute;r&ecirc;t &agrave; le faire d&egrave;s que les points
d'exp&eacute;rience auront cess&eacute; de s'incr&eacute;menter. D'un
autre c&ocirc;t&eacute;, il est facile de l'ignorer si vous ne
d&eacute;sirez pas l'utiliser.<br />
<br />
<strong>R&eacute;&eacute;quilibrage des caract&eacute;ristiques des PNJs de
BG1</strong> - <em>Facultatif ; pour Tutu et BGT uniquement</em><br />
<br />
Ce composant ajuste les caract&eacute;ristiques des PNJs de BG1, comme abord&eacute;
dans <a href="http://gibberlings3.net/forums/index.php?showtopic=15001">ce sujet</a>.
Le mod original est d' Ergopad ; mos_anted ayant r&eacute;alis&eacute;
de l&eacute;gers ajustements (abord&eacute; plus loin dans le
sujet). Vous disposez par cons&eacute;quent de deux choix (voire de
trois puisque vous pouvez choisir de le passer, ce qui sera le cas de
toute mani&egrave;re si vous installez le mod dans BG2).<br />
<br />
<strong>Dudleyfix pour les PNJs de BG1</strong> - <em>Facultatif ; pour
Tutu et BGT uniquement</em><br />
<br />
Ce composant "corrige" les caract&eacute;ristiques des PNJs de BG1, comme
abord&eacute; sur <a href="http://forgottenwars.com/dudleyfix/bg1_npcs.htm">cette page</a>.
Il s'occupe essentiellement d'incoh&eacute;rences diverses et vari&eacute;es,
comme not&eacute;es dans cette page.<br />
<br />
<strong>Correction des sorts et capacit&eacute;s inn&eacute;es des PNJs de
BG1</strong> - <em>Facultatif ; pour Tutu et BGT uniquement</em><br />
<br />
Comme au-dessus, ceci corrige diverses incoh&eacute;rences de
livres de sorts et de
capacit&eacute;s inn&eacute;es. C'est le dernier des 3 composants
d'Ergopad, propos&eacute; ici par commodit&eacute;, avant de
proc&eacute;der &agrave; des modifications ult&eacute;rieures sur les
PNJs.<br />
<br />
<strong>Mise &agrave; jour des r&eacute;f&eacute;rences par le jeu aux
classes/kits des PNJs</strong> - <em>Facultatif</em><br />
<br />
Ce composant ne fait rien en lui-m&ecirc;me, mais permet la mise
&agrave; jour dans le jeu des dialogues, des descriptions d'objets et
des biographies de personnage qui font r&eacute;f&eacute;rence &agrave;
une classe ou &agrave; un kit de PNJs dont vous avez chang&eacute; la
classe ou le kit. Il est tr&egrave;s s&eacute;lectif ; par exemple, il
n'effectue pas le changement dans les dialogues qui la
mentionnent de la d&eacute;it&eacute; d'un clerc dont vous auriez
chang&eacute; le kit - bien que si vous en avez chang&eacute; la
classe, le clerc se verra alors qualifi&eacute; de paladin (ou autre)
de ladite d&eacute;it&eacute;. Les changements devraient &ecirc;tre
enregistr&eacute;s dans le fichier batchlog/l1dlg.txt. Veuillez joindre
ce fichier &agrave; votre message sur le forum si vous
d&eacute;sirez rapporter un quelconque probl&egrave;me dans
l'utilisation de ce
composant (qui est facultatif, comme nous l'avons d&eacute;j&agrave;
mentionn&eacute; par ailleurs).<br />
<br />
<strong>Modifier un personnage</strong> - <em>Facultatif</em><br />
      <br />
Ces composants vous permettent de modifier de fa&ccedil;on individuelle
les classes et/ou les kits des PNJs install&eacute;s dans votre jeu.
Vous pouvez choisir parmi toutes les classes disponibles, y compris les
classes jumel&eacute;es. Puis, vous pourrez choisir d'assigner un kit
&agrave; la(aux) classe(s) que vous aurez assign&eacute;e(s). Le moteur
ne permet pas d'assigner plus d'un kit. Cependant, vous pouvez choisir
ces kits parmi ceux apport&eacute;s par d'autres mods. Vous pouvez bien
entendu choisir de ne pas assigner de kit. <br />
</div>
<h2>
      <a name="thanks" id="thanks">Remerciements</a>
    </h2>
<div class="section">Merci &agrave; Gebhart Blucher pour les
concept et mod originaux de changement des kits assign&eacute;s
&agrave; plusieurs PNJs par d&eacute;faut<acronym title="Non-Player Characters"></acronym>.
Et de nous avoir donn&eacute; ses encouragements explicites pour poursuivre son concept.<br />
<br />
Mille mercis &eacute;galement &agrave; :
<ul>
    <li>Les agneaux qui vont &agrave; l'abattage... euh, les courageux testers :
    Miloch, Kulyok, Raven_Song, Padisha et kimmel. Mille mercis !
    </li>
    <li>CamDawg : Dawg != ward :)
    </li>
    <li>igi : j'aime l'<acronym title="Infinity Engine Structures Description Project">IESDP</acronym>.
    </li>
    <li>Avenger : j'aime vraiment l'<acronym title="Infinity Engine Structures Description Project">IESDP</acronym>.
    </li>
    <li>Wes Weimer : <acronym title="Weimer Dialogue Utility">WeiDU</acronym> m'aime.
    </li>
    <li>the Bigg : mais <acronym title="Weimer Dialogue Utility (WeiDU) now maintained by the bigg">BiggDU</acronym>
    a vol&eacute; mon coeur.
    </li>
    <li>Ggib eht : er&egrave;ilucitrap nosiar enu ruop.
    </li>
    <li>devSin : pour m'avoir temp&eacute;r&eacute;e.
    </li>
    <li>jcompton : pour avoir kidnapp&eacute; la plupart des
moddeurs de l'IE et de les avoir incarc&eacute;r&eacute;s dans la manufacture de The
Broken Hourglass&trade;.
     </li>
    <li>Man At Work : J'AI ADORE ton test de l'am&eacute;lioration de Barl !
    </li>
    <li>The Gibberlings Three qui ont &eacute;t&eacute;
suffisamment bons pour ne pas m'&eacute;jecter en d&eacute;pit de mon
attitude irrascible et rev&ecirc;che. :)</li>
    <li>Dirty Uncle Bertie : pour avoir d&eacute;nich&eacute; et corrig&eacute; des tonnes
    de bugs en une liste facilement assimilable. -erik</li>
    <li>Lord Psion et Ancalagon el Negro : pour la traduction espagnole </li>
    <li>Graoumf et Isaya : pour la traduction fran&ccedil;aise </li>
    <li>yarpen et Lava Del'Vortel : pour la traduction polonaise </li>
    <li>Ergopad : pour les composants relatifs aux PNJs de BG1 (avec une option de
    modification suppl&eacute;mentaire par mos_anted)</li>
</ul>
Merci &agrave; la communaut&eacute; du modding sous l'Infinity Engine
qui continue d'offrir encouragements, supports, rapports des bugs,
suggestions et commentaires. Ce mod a &eacute;t&eacute;
cr&eacute;&eacute; par et pour la communaut&eacute; : vous &ecirc;tes
tous encourag&eacute;s &agrave; le d&eacute;velopper et &agrave;
apporter votre pierre &agrave; l'&eacute;difice.<br />
      <br />
      <strong>Outils utilis&eacute;s durant la cr&eacute;ation</strong><br />
      <a href="http://weidu.org/main.html#weidu"><acronym title="Weimer Dialogue Utility">WeiDU</acronym></a>
      par Wes Weimer et the bigg<br />
      <a href="http://forums.pocketplane.net/index.php/topic,22727.msg297145.html#msg297145">
      Near Infinity</a> par Jon Olav Hauglid, FredSRichardson et devSin<br />
      <a href="https://gibberlings3.github.io/iesdp/"><acronym title="Infinity Engine Structures Description Project">IESDP</acronym></a>
      maintenu par igi et Avenger
    </div>
<h2>
      <a name="contact" id="contact">G&eacute;n&eacute;rique et Informations de droits d'auteur</a>
    </h2>
<div class="section">
      <a href="http://gibberlings3.net/forums/?showuser=1119">Nythrun</a> a cr&eacute;&eacute;
      ce mod, avec l'assistance de <a href="http://gibberlings3.net/forums/index.php?showuser=844">cmorgan</a>,
      <a href="http://gibberlings3.net/forums/index.php?showuser=795">Azazello</a>,
      <a href="http://gibberlings3.net/forums/index.php?showuser=1216">Miloch</a>
      et d'autres. Visitez <a href="http://gibberlings3.net/forums/index.php">The
      Gibberlings Three</a> pour des informations sur ce mod. Level
      1 <acronym title="Non-Player Characters">NPCs</acronym> est copyright&eacute; &copy;
      2007-2011 Elizabeth Strand (contacter Nythrun sur le
      <a href="http://gibberlings3.net/forums/index.php?showforum=140">forum</a> du mod).<br />
      <br />
      Cette r&eacute;alisation (code et documentation inclus) est mise &agrave;
      disposition suivant les termes de la
      <a href="http://creativecommons.org/licenses/by-nc/3.0/">Creative Commons
      Attribution-Noncommercial 3.0 Unported License</a>.
      Vous &ecirc;tes libre de partager (copier, distribuer et transmettre)
      et de remixer (adapter) ce travail, except&eacute; &agrave; des fins
      commerciales. Si vous affirmez l'avoir &eacute;crit, les auteurs
      pourraient vous tourner gentiment en ridicule :).<br />
      <br />
      Ce programme est distribu&eacute; dans l'espoir qu'il sera utile, mais
      SANS AUCUNE GARANTIE ; sans m&ecirc;me la garantie tacite COMMERCIALE
      ou pour la FORME DANS UN BUT PRECIS. Voir la
      <a href="http://creativecommons.org/licenses/by-nc/3.0/legalcode">Creative
      Commons Public License</a> pour davantage de d&eacute;tails.<br />
      <br />
      Ce ne sont pas des "corrections de <acronym title="Tortured Souls">TS</acronym>".
      Vraiment.
    </div>
    <h2>
      <a name="history" id="history">Historique des versions</a>
    </h2>
    <div class="section">
    <strong>Todo</strong>
      <ul>
        <li>Find some non-intrusive way to limit proficiency selection to
        weapons the character has sufficient stats to wield, if desired</li>
        <li>Recode deprecated component, somehow (bwahahaha...)</li>
        <li>Add support for "give them this much experience and stop,
        so that I can dual-class them." That'll be fun.</li>
      </ul>
    <strong>Version 1.7: More Orcish Bugfixing (17Mar11)</strong>
      <ul>
        <li>Implemented the bigg's improved <acronym title="resource reference">resref</acronym>
        <acronym title="regular expression">regexp</acronym></li>
        <li>Fixed bug with Yeslick's <acronym title="hit points">HP</acronym>
        in Ergopad's Dudleyfix component</li>
        <li>Fixed "arrowless" bug in cleric/ranger longbow tweak</li>
        <li>Added longbows-only option to cleric/ranger tweak</li>
        <li>Fixed bug in "Update game references" component referencing
        Branwen's biography</li>
        <li>Fixed bug in fighter/druid armor tweak installing on its own</li>
        <li>Added rejoining subcomponent for "Joinable
        <acronym title="Non-Player Characters">NPCs</acronym> more closely match
        the PC's experience"</li>
        <li>Eliminated cheesy "poof" when experience-matching component invoked</li>
        <li>Changed description updating to match game language rather than mod
        installation language</li>
        <li>Fixed creature-ordering macros to use latest versions and avoid
        corrupting files further</li>
        <li>Changed weapon-tweaking component so it doesn't start over from
        scratch if you make one mistake</li>
        <li>Added Nephele <acronym title="Non-Player Character">NPC</acronym>
        component</li>
        <li>Added existing <acronym title="Non-Player Character">NPC</acronym>
        variants (Coran, Eldoth, etc.)</li>
        <li>Fixed several bugs in assigning monk class to characters</li>
        <li>Implemented class/kit-based ability determination</li>
      </ul>
    <strong>Version 1.6: Absolutely No Bugs Here (5Dec10)</strong>
      <ul>
        <li>Fixed glitches with <acronym title="Throne of Bhaal">ToB</acronym>
        <acronym title="Non-Player Characters">NPCs</acronym></li>
      </ul>
    <strong>Version 1.5: Geomantic Sorcerers are not Druids (28Nov10)</strong>
      <ul>
        <li>Re-enabled kit menu for sorcerers to allow
        <a href="http://www.gibberlings3.net/geomantic/">Geomantic Sorcerer</a> kitting</li>
        <li>Fixed typos in non-English translations</li>
        <li>Recommented out some sub-functional 2da patching</li>
        <li>Fixed a variable typo preventing installation on <acronym title="Baldur's Gate 'To Two'">Tutu</acronym></li>
      </ul>
    <strong>Version 1.4: Miloch's Mad Orcish Rampage (9Nov10)</strong>
      <ul>
        <li>Added French and Spanish translations; updated Polish translation</li>
        <li>Added optional dialogue-modding component and logging</li>
        <li>Added altered proficiency support (a la <acronym title="Baldur's Gate II">BG2</acronym>
Tweaks) for modded <acronym title="Non-Player Characters">NPCs</acronym></li>
        <li>Added display conversion for accented characters leeched from game text</li>
        <li>Added function to display current <acronym title="Non-Player Character">NPC</acronym> stats</li>
        <li>Tweaked animation assignment (primarily to avoid bearded female gnomes
    and the like)</li>
        <li>Fixed <acronym title="regular expression">regexp</acronym> typo pertaining
    to one-handed axes</li>
        <li>Revised weapon assignment routine to avoid duplicate and redundant weapons</li>
        <li>Revised armour assignment routine to make heavier armour more realistic
        (also fixed some bugs)</li>
        <li>Added more options to the "Tweak weapon proficiencies" component
        (largely specific to multi-classes and barbarians); fixed a bug or two</li>
        <li>Auto-skipped weapon-tweaking questions if another mod has done something
        similar</li>
        <li>Skipped kit menu for sorcerers and monks (if someone hacks that, we can
        re-enable it)</li>
        <li>Added support for mod <acronym title="Non-Player Characters">NPCs</acronym></li>
        <li>Fixed a bug in setting item "baseclass" usability if no kit chosen</li>
        <li>Fixed kit display in deprecated component and undeprecated it via
        NO_LOG_RECORD (yes, it should be safe, but keep extra backups just
        in case)</li>
        <li>Required main component for all subcomponents to avoid uninstall and
        reinstall glitches</li>
        <li>Added "hard to kill" support for Ajantis, Shar-Teel and Viconia
        pre-joining</li>
        <li>Fixed bug in proficiency assignment for Haer'Dalis, Jan and Xan</li>
        <li>Added Ergopad's "<acronym title="Non-Player Character">NPC</acronym>
        Attributes" components for <acronym title="Baldur's Gate I">BG1</acronym>
        <acronym title="Non-Player Characters">NPCs</acronym> (with an extra option
        by mos_anted)</li>
        <li>Added option to manually mess further with <acronym title="Non-Player Character">NPC</acronym>
        attributes</li>
        <li>Grouped components for easier selection (or not)</li>
        <li>Added sample batch file installer</li>
        <li>Updated to <acronym title="Weimer Dialogue Utility">WeiDU</acronym>
        v224</li>
        <li>Enhanced <acronym title="Non-Player Character">NPC</acronym> custom
        item compatibility</li>
        <li>Possibly other stuff I've forgotten that Nythrun has probably already
        recoded in some better form ;)</li>
      </ul>
    <strong>Version 1.3: The Bugs Are Especially Squishy This Year, Right Boo? (21Jan10)</strong>
      <ul>
        <li>Fixed: install failure with <acronym title="Never-Ending Journey II">NEJ2</acronym></li>
        <li>Fixed: armed and armoured Viconia at the stake in <acronym title="Shadows of Amn">SoA</acronym></li>
        <li>Fixed (several times): various people not affected by "More closely
        match protagonist experience" in various situations</li>
        <li>Fixed: lowest-level variants of Viconia and Imoen not changed in SoA</li>
        <li>Fixed: Xan was offered for changing in <acronym title="Shadows of Amn">SoA</acronym>,
        though he's just a tutorial character</li>
        <li>Fixed: fighter/druid proficiency bug without multiclass grand mastery</li>
        <li>Fixed: tieflings should use elven avatar, not human</li>
        <li>Fixed: <acronym title="Non-Player Character">NPC</acronym> experience
        matching was overly generous when protagonist had 100k-190k <acronym title="experience points">XP</acronym></li>
        <li>Fixed: kitted multiclasses were limited to kit weapon proficiencies, now
        limited to base multiclass proficiencies instead, as that's what takes effect in-game</li>
        <li>Fdded: bonus longbow star for Coran</li>
        <li>Fixed: Don't-get-so-hurt banters triggering too soon in <acronym title="Baldur's Gate II">BG2</acronym></li>
        <li>Fixed: Haer'Dalis bonus star (and again with v13eib1)</li>
        <li>Fixed: Aerie doing a runner if changed to sorcerer or mage (v13eib2)</li>
      </ul>
    <strong>Version 1.2: Rebuilding Berlin One Newline At A Time. (17Jan09)</strong>
      <ul>
        <li>Updated to <acronym title="Weimer Dialogue Utility">WeiDU</acronym> v210</li>
        <li>erik's Repaired tp2 newline for German versions</li>
      </ul>
    <strong>Version 1.1: Poland's Translating, London's Calling. (20Aug08)</strong>
      <ul>
        <li>Updated to <acronym title="Weimer Dialogue Utility">WeiDU</acronym> v208</li>
        <li>Added yarpen's Polish translation</li>
      </ul>
    <strong>Version 1: First Official Release (23Dec07)</strong>
      <ul>
        <li>Updated to <acronym title="Weimer Dialogue Utility">WeiDU</acronym>
        v203; small WeiDU bug in PRETTY_PRINT_2DA hacked around
        </li>
        <li>Changes made to the weapon proficiency rules now apply to any kits
        added by mods as well
        </li>
        <li>New option in the <strong>Tweak weapon proficiencies for some
        classes</strong> component: Restrict all two-handed weapons from bonus
        backstab damage
        </li>
        <li><acronym title="Experience Point">XP</acronym> adjuster slightly
        recoded
        </li>
        <li>Added rest script to <acronym title="Experience Point">XP</acronym> adjuster
        </li>
        <li>Some paucity of spells (i.e. 1-2) will be memorized before joining
        </li>
        <li>Yes/no prompt for retaining Minsc rage
        </li>
        <li>Quickslot/inventory prompt for expatriating Boo
        </li>
        <li>Optional Boo annihilation added for your cruel pleasure. It's
        less fun than it might sound.
        </li>
        <li>Added the option to abort the install of a component by entering 0
        at the class selection menu, to make those "Oops! I didn't mean to press
        [A]!" errors less painful
        </li>
        <li>
        <a href="http://www.shsforums.net/index.php?showforum=261">
        <acronym title="Baldur's Gate Trilogy">BGT</acronym></a> users only:
        if the Level Zero NPCs component of <a href="http://www.gibberlings3.net/scs/">
        <acronym title="Sword Coast Stratagems">SCS</acronym></a> has been
        installed, it will now be possible to modify the Shadows of Amn
        incarnations of a given <acronym title="Non-Player Character">NPC</acronym>.
        It's still preferable that you not install that particular component of
        DavidW's mod along with this mod, but it doesn't cause any (known) problems :)
        <acronym title="Sword Coast Stratagems">SCS</acronym> really is rather
        good, by the way.
        </li>
        <li>Omission of unselectable kits recoded to avoid issues with new
        versions of <a href="http://www.shsforums.net/index.php?showforum=116">
        Refinements</a> et al.
        </li>
        <li>Illegal mage kit multiclasses no longer penalized with their weapon
        proficiency assignments (again)
        </li>
        <li>Fixed Imoen not always receiving her sorcerer spells
        </li>
        <li>Optional restriction of fighter/druids from druid-unusable armors
        will not display if the Druid Remix component of <a href=
        "http://www.gibberlings3.net/cleric/">Divine Remix</a> is installed,
        as something identical is already included in that mod
        <li>Thief/mages occasionally receiving chainmail in their automatic
        new equipment assignment (as though they were bards) fixed
        </li>
        <li>Added code to fix hdragsil.cre if broken by a conflict between
        <a href="http://www.pocketplane.net/quest/">Quest Pack</a> and
        <a href="http://www.gibberlings3.net/scsii/"><acronym title=
        "Sword Coast Stratagems II">SCS II</acronym></a> (won't be making a
        habit of this). In addition, some small and pitiful amount of bugfixes
        to items introduced by other mods is gradually being incorporated,
        though only when necessary to prevent errors when installing this
        mod. Prevention of crashes is but collateral damage.
        </li>
      </ul><strong>Version 0.7: Ultimate Beta Revisited (with new improved
      spellchecking)! (19Oct07)</strong>
      <ul>
        <li>Updated readme and <acronym title=
        "Weimer Dialogue Utility">WeiDU</acronym> to v201; renamed to
        "level1npcs" because there seems to be a bunch of versions floating
        around out there; packaged for <acronym title="The Gibberlings Three">
          G3</acronym>
        </li>
        <li>Fixed regexp to catch aerie10.cre; no other significant code
        touched (cmorgan just ogled and whistled at it while studying it)
        </li>
      </ul><strong>Version 0.6: Ultimate Beta! (31May07)</strong>
      <ul>
        <li>Added a new component to allow <acronym title=
        "Non-Player Characters">NPCs</acronym> to have an <acronym title=
        "Experience Point">XP</acronym> total closer to the <acronym title=
        "Player Character">PC</acronym>'s upon joining. I'm discontent with it
        at the moment.
        </li>
        <li>Removed the remainder of the bugfixes (exception: effect version
        for Tutu creatures) in the interests of compatibility
        </li>
        <li>Fixed a problem (?) with fighter/thief hitpoints
        </li>
        <li>Fixed a problem with fighter/non-mage kitted multiclasses receiving
        an overly restrictive menu of weapon proficiencies
        </li>
        <li>Removed some typo corrections that were applied to original game
        files; no one else cares that avengers are referred to as BEAST_FRIEND
        which was dropped before <acronym title=
        "Baldur's Gate II">BG2</acronym>'s release :)
        </li>
        <li>Added a Divine Remix style option to restrict fighter/druids from
        armors single class druids cannot wear. It's in the weapon proficiency
        tweaks, and it's optional in an optional component :).
        </li>
      </ul><strong>Version 0.5: Barely Beta! (31Mar07)</strong>
      <ul>
        <li>Updated to <acronym title="Weimer Dialogue Utility">WeiDU</acronym>
        v199. There are still a few cases where I'm using some stupid hack
        rather than a nice <acronym title=
        "Weimer Dialogue Utility">WeiDU</acronym> action, but things in general
        ought to work better. Please note that this mod cannot run on
        <acronym title="Weimer Dialogue Utility">WeiDU</acronym> versions
        earlier than 199: the bigg has fixed too many bugs and added too many
        new features.
        </li>
        <li>Completely rebuilt primary component; installation ought to proceed
        much more quickly. Consequently, most of the creature correction
        routine has been removed. Please let me know if the mod chokes on any
        creatures and I'll endeavor to fix them on a case-by-case basis.
        </li>
        <li>Completely rewrote the weapon assignation routine; it should be
        slightly stingier now. Please report any cases of duplicating items to
        me so that I may kill myself or fix any remaining bugs, depending on my
        mood at the time.
        </li>
        <li>Completely rewrote the armor assignation routine too
        </li>
        <li>Weapons that have usability restrictions altered by the mod will
        have their descriptions updated. We've lost the 3,600 character regular
        expression and reverted to a simpler match, so it should be much faster
        than the original.
        </li>
        <li>Mages will have one spell and specialist mages two spells memorized
        when met in game, as a courtesy to those who have no time to rest.
        Priests will come with a Cure Light Wounds. Sorcerers come with their
        own peculiar mechanical implementation.
        </li>
        <li>Sorcerer kits that select fewer than two spells at first level can
        be added now. Uh, who is making sorcerer kits, again?
        </li>
        <li>Deprecated the "Kit exported characters" subcomponent, as the
        coding was far too advanced for my own good (i.e. it causes terrible
        problems upon uninstall because I am an idiot). Sorry about that. Flee
        this component.
        </li>
        <li>
        <acronym title="Baldur's Gate">BG</acronym> Imoen's Magic Missile
        wand had entirely too many charges; now it has ten
        </li>
        <li>Includes swank HTMLed readme. Thanks, Miloch!
        </li>
        <li>TP2 now contains a few comments. Not many. May add more. Feeling
        terse.
        </li>
      </ul><strong>Version 0.4: Beta! (20Mar07)</strong>
      <ul>
        <li>Major bug that could delete files fixed. I have done the impossible
        with <acronym title="Weimer Dialogue Utility">WeiDU</acronym>, and it
        sucked a lot.
        </li>
        <li>Fixed a bug that prevented installation
        </li>
        <li>Auto-skipping of unavailable <acronym title=
        "Non-Player Characters">NPCs</acronym> actually works now
        </li>
        <li>Fixed a bug that caused multi-classes with Mage kits to receive an
        unduly restrictive selection of weapon proficiencies
        </li>
        <li>Code to skip adding items to <acronym title=
        "Non-Player Characters">NPCs</acronym> who shouldn't have any actually
        works now (OR and AND are not equivalent in respectible truth tables,
        silly!)
        </li>
        <li><acronym title="Non-Player Characters">NPCs</acronym> with super
        special weapons will now have their proficiencies with that weapon
        incremented by one if they have some already
        </li>
        <li>Cleaned up some slop in a couple macros (no effect, but tidier)
        </li>
        <li>Added component which allows kitting of exported characters if they
        have none already. Be very careful with this.
        </li>
        <li>Removed GROUP usage that was wasting time and accomplishing
        nothing.
        </li>
        <li>Commented out the item description updater - it's just too slow
        </li>
      </ul><strong>Version 0.3: Alpha Three (8Mar07)</strong>
      <ul>
        <li>Corrected a bug where some kits received weapon proficiencies from
        the next kit in kitlist.2da
        </li>
        <li>Gave sorcerers their second level one spell (whoops!)
        </li>
        <li>Blocked <acronym title="Baldur's Gate II">BG2</acronym>
        <acronym title="Non-Player Character">NPCs</acronym> from displaying in
        Tutu
        </li>
        <li>Added code to convert any creature effect version to v2
        automatically (this has to be done to prevent LOCALS from being
        truncated if over eight charcters, and to make sure they can be saved)
        </li>
        <li>Fixed typo in class selection menu
        </li>
        <li>Blocked barbarians from being selectable as a multiclass (sorry,
        hardcoded hitpoint funk here; I can't make this work well)
        </li>
        <li>Two-handed weapons will now be equipped (unless you've selected
        another weapon afterwards, naturally :) )
        </li>
        <li>Made cleric/mages use the (correct) cleric avatar rather than the
        mage avatar
        </li>
        <li>Xan's Moonblade will now be a longsword usable by whatever Xan is,
        and he'll get a proficiency point in longsword for free whether that's
        normally allowed or not: this represents his deep spiritual bond with
        the weapon in the only way the uncouth <acronym title=
        "Baldur's Gate II">BG2</acronym> engine can express :)
        </li>
        <li>Fixed a bug where <acronym title=
        "Non-Player Characters">NPCs</acronym> would stockpile weapons in their
        inventory; should be one per customer, iron crisis or no
        </li>
        <li>Made the armor assignation for <acronym title=
        "Baldur's Gate">BG</acronym> <acronym title=
        "Non-Player Characters">NPCs</acronym> a bit less generous
        </li>
        <li>Added a bloated preliminary component that allows tampering with
        weapon proficiency rules. While there are other, standalone mods that
        do this, if you want altered rules to apply for this mod, those altered
        rules would have to be installed first. So I'm doing it for you :).
        </li>
        <li>Forced barbarian and wild mage symbols to take a value of 0 in
        kit.ids
        </li>
      </ul><strong>Version 0.2: Alpha Two (16Feb07)</strong>
      <ul>
        <li>Approximately Moser's number worth of bugs fixed
        </li>
      </ul><strong>Version 0.1: Alpha One (2Feb07)</strong>
      <ul>
        <li>Let us never speak of this again
        </li>
      </ul>
    </div>
  </body>
</html>
